Pipe Flow Validation/Linux Files/cases/laminar_Re100/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

// Ubar is controlled by meanVelocityForce; this is the initial condition.
// z-component = Ubulk placeholder, overwritten by run_sweep.sh
internalField   uniform (0 0 0.030000);

boundaryField
{
    inlet   { type cyclic; }
    outlet  { type cyclic; }
    wall    { type noSlip; }
    front   { type wedge; }
    back    { type wedge; }
    axis    { type empty; }
}
